---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDependentView
source: html/1ca640d4-3cd1-77d3-48d9-96765a373415.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyDependentView Property

Dependent views cannot be copied.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyDependentView { get; }
```